info_prod = [
    ('2024-04-04', 1, 'Проездной', 'Транспорт', 35),
    ('2024-04-04', 2, 'Булочка', 'Еда', 67),
    ('2024-04-05', 3, 'Йогурт питьевой', 'Еда', 100),
    ('2024-04-05', 4, 'Батут', 'Развлечения', 1000),
    ('2024-04-01', 5, 'Телефон', 'Личные покупки', 50000),
    ('2024-04-01', 6, 'Ноутбук', 'Личные покупки', 78000),
    ('2024-03-30', 7, 'Колесо обозрения', 'Развлечения', 700),
    ('2024-03-28', 8, 'Пицца', 'Еда', 550),
    ('2024-03-28', 9, 'Платье', 'Личные покупки', 1980),
    ('2024-04-03', 10, 'Такси', 'Транспорт', 291),
]